controller/test.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://schemas.icta.lk/xsd/kannel/handler/v1/" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<soapenv:Header>
<govsms:authData xmlns:govsms="http://govsms.icta.lk/">
<govsms:user>icta</govsms:user>
<govsms:key>g0v5ms123</govsms:key>
</govsms:authData>
</soapenv:Header>
<soapenv:Body>
<v1:SMSRequest>
<v1:requestData>
<v1:outSms>Sms test test</v1:outSms>
<v1:recepient>94715432753</v1:recepient>
<v1:depCode>IctaTest</v1:depCode>
<v1:smscId/>
<v1:billable/>
</v1:requestData>
</v1:SMSRequest>
</soapenv:Body>
</soapenv:Envelope>